{"data":{"site":{"siteMetadata":{"title":"Annu Dhingra","description":"MBA (Amity Business School)","year":"2019","author":{"name":"Annu Dhingra","avatar":"/img/avatar.jpeg","bio":"<p>I hold an experience of five plus years in the segment of <strong>e-commerce, Presales/B2B Sales, Marketing & Communication, Brand Management/Strategy Consulting/Advisory Services, Client Relationship Management and Program Management, Data Analytics, Market Research, Business Proposal writing/RFP mgmt.</strong> etc.</p>","social":{"phone":"+91 9953152955","email":"dhingrannu@gmail.com","linkedin":"annu-dhingra-588170147"}},"resume":{"description":"<p><strong>Presently associated with Make My Trip India Pvt Ltd, Gurgaon as Senior Business Manager.</strong></p>\n  <ul>\n    <li>Demonstrated abilities in communication, image and brand building; growing & managing stakeholder relationships.</li>\n    <li>Possess strong skills in <strong>Data Analytics, Marketing Communications, Strategic Planning & Development</strong>, Brand Building, Corporate Strategy, etc.</li>\n    <li>Deft at handling supply vendors and giving them value added experience; deriving market insights through data and regular market visits.</li>\n    <li>An <strong>out-of- box thinker</strong> with a flair for charting out marketing strategies.</li>\n    <li>An effective communicator with good presentation skills and abilities in establishing beneficial relationships with working partners, trade & target-audience.</li>\n    <li>Business Process re-engineering.</li>\n  </ul>","skills":[{"name":"Strategic Planning","level":90},{"name":"Marketing and Sales","level":80},{"name":"Process Re-Engineering","level":70},{"name":"Corporate Communication","level":80},{"name":"Analytics","level":70},{"name":"Client Servicing","level":90},{"name":"Business Development","level":90},{"name":"Coordination and Liason","level":90},{"name":"Brand Management","level":70}],"timeline":[{"name":"Experience","events":[{"title":"Senior Business Manager","subtitle":"Make My Trip India Pvt Ltd, Gurgaon","type":"job","startDate":"May 2016","endDate":null,"points":["Accountable to manage e-commerce business across the given region.","Develop, build, and maintain strong relationships with partners.","Drive profitability for the business through margins, promotions and exclusive programs with partners.","To <strong>work across cross functional teams</strong> (Product, Technology, Category, Marketing etc) within the organization and drive the best always.","Responsible for undertaking special initiatives with hoteliers, <strong>conduct trainings, surveys and offer insights basis data gathered.</strong>","Nurturing deals by sharing best practices and business insights with hotel partners.","Received <strong>“Rising Tripper of the Month” in April’17.</strong>","Received <strong>“Go-Tripper of the Month” in May’17.</strong>","Appreciation from National Head for undertaking special project for increasing business in relevant market segment.","Managing a cluster of 400+ hotels and increased market share by 30% in current market- Uttarakhand"]},{"title":"Relationship Manager","subtitle":"HDFC Bank, New Delhi","type":"job","startDate":"September 2015","endDate":"May 2016","points":["<strong>Mapping the requirement of the clients’</strong> & providing the best products and services; generating business from existing accounts and achieving profitability growth.","Building and maintaining <strong>healthy business relations</strong> with major institutional and corporate clients, ensuring customer satisfaction by achieving delivery & service quality norms.","Generating business from existing accounts and achieving profitability and <strong>increased sales growth</strong>.","Providing assistance to the branch head in the <strong>development of short (sales drives) and long-term (for big ticket cases) strategic plans, to achieve the income and value targets</strong>.","Identifying and analysing new business opportunities; involved in resolving customer queries, leading to customer engagement and business generation.","Bagged an award “TPP Champions” for Mutual Fund annual plan achievement. ","Merit of receiving recognition from the Cluster head for being a top performer in sales drive.","Distinction of being the top 10 lead generators, PAN India for new to bank customer acquisition drive with an initial payment cheque of 12 lacs."]},{"title":"Business Development Manager","subtitle":"Refresh Ideas, New Delhi","type":"job","startDate":"December 2013","endDate":"August 2015","points":["Making a list of companies that can be looked at for business purpose.","<strong>Calling prospective clients</strong> with the help of leads figured out by own way of tracking or getting leads by CEO.","Pitching to the clients over the phone.","Fixing appointments, scheduling meetings and making presentations to the client on Company’s business and functioning."]}]},{"name":"Education","events":[{"title":"Strategic Leadership Program","subtitle":"Indian Institute of Management (IIM), Kozhikode","type":"education","startDate":"December 2018","endDate":"August 2019","points":null},{"title":"MBA in Marketing & Finance (Secured 7.66/10)","subtitle":"Amity Business School, Noida","type":"education","startDate":"August 2013","endDate":"August 2015","points":null},{"title":"B.Com. (Secured 69.4%)","subtitle":"Gargi College, University of Delhi","type":"education","startDate":"July 2010","endDate":"August 2013","points":null},{"title":"Diploma in Advertising and Marketing Communication","subtitle":" Gargi College, University of Delhi","type":"education","startDate":"August 2010","endDate":"August 2011","points":null}]}]}}}},"pageContext":{"isCreatedByStatefulCreatePages":true}}